# Нормы учебной нагрузки (инвариантная составляющая)
MINISTRY_REQUIREMENTS = {
    # 1-4 классы
    1: {"Укр. мова": 7, "Англ. мова": 2, "Математика": 3, "Я досліджую світ": 7, "Мистецтво": 2, "Фізична культура": 3},
    2: {"Укр. мова": 7, "Англ. мова": 3, "Математика": 4, "Я досліджую світ": 5, "Мистецтво": 2, "Інформатика": 1,
        "Фізична культура": 3},
    3: {"Укр. мова": 7, "Англ. мова": 3, "Математика": 5, "Я досліджую світ": 5, "Мистецтво": 2, "Інформатика": 1,
        "Фізична культура": 3},
    4: {"Укр. мова": 7, "Англ. мова": 3, "Математика": 5, "Я досліджую світ": 4, "Мистецтво": 2, "Інформатика": 1,
        "Фізична культура": 3},

    # 5-9 классы
    5: {"Укр. мова": 4, "Укр. літ.": 2, "Англ. мова": 4, "Зарубіжна літ.": 1.5, "Математика": 5, "Історія України": 1,
        "Пізнаємо природу": 2, "Інформатика": 1.5, "Здоров’я": 1, "Мистецтво": 2, "Технології": 2,
        "Фізична культура": 3},
    6: {"Укр. мова": 4, "Укр. літ.": 2, "Англ. мова": 4, "Зарубіжна літ.": 1.5, "Математика": 5, "Історія України": 1.5,
        "Пізнаємо природу": 2, "Географія": 2, "Інформатика": 1.5, "Здоров’я": 1, "Мистецтво": 2, "Технології": 2,
        "Фізична культура": 3},
    7: {"Укр. мова": 3, "Укр. літ.": 2, "Англ. мова": 3, "Зарубіжна літ.": 1.5, "Алгебра": 2.5, "Геометрія": 2,
        "Історія України": 1, "Всесвітня історія": 1, "Фізика": 1.5, "Хімія": 1, "Біологія": 2, "Географія": 2,
        "Інформатика": 1.5, "Здоров’я": 1, "Мистецтво": 1, "Технології": 1, "Фізична культура": 3},
    8: {"Укр. мова": 3, "Укр. літ.": 2, "Англ. мова": 3, "Зарубіжна літ.": 1.5, "Алгебра": 2, "Геометрія": 2,
        "Історія України": 1.5, "Всесвітня історія": 1, "Фізика": 2, "Хімія": 2, "Біологія": 2, "Географія": 2,
        "Інформатика": 2, "Основи здоров’я": 1, "Мистецтво": 1, "Технології": 1, "Фізична культура": 3},
    9: {"Укр. мова": 3, "Укр. літ.": 2, "Англ. мова": 3, "Зарубіжна літ.": 1.5, "Алгебра": 2, "Геометрія": 2,
        "Історія України": 1.5, "Всесвітня історія": 1, "Правознавство": 1, "Фізика": 3, "Хімія": 2, "Біологія": 2,
        "Географія": 2, "Інформатика": 2, "Основи здоров’я": 1, "Мистецтво": 1, "Технології": 1, "Фізична культура": 3},

    # 10-11 классы
    10: {"Укр. мова": 2, "Укр. літ.": 2, "Англ. мова": 3, "Зарубіжна літ.": 1.5, "Алгебра": 3, "Геометрія": 2,
         "Історія України": 1.5, "Всесвітня історія": 1, "Громадянська освіта": 2, "Фізика": 3, "Хімія": 2,
         "Біологія": 2, "Географія": 1.5, "Інформатика": 2, "Захист України": 2, "Мистецтво": 1.5,
         "Фізична культура": 3},
    11: {"Укр. мова": 2, "Укр. літ.": 2, "Англ. мова": 3, "Зарубіжна літ.": 1.5, "Алгебра": 3, "Геометрія": 2,
         "Історія України": 1.5, "Всесвітня історія": 1, "Фізика": 3, "Хімія": 2, "Біологія": 2, "Географія": 1.5,
         "Інформатика": 2, "Захист України": 2, "Мистецтво": 1.5, "Фізична культура": 3}
}